/************************************************************
 * 版权：2025CIMC Copyright。
 * 文件：timer.h
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2025/12/29     V0.01    original
************************************************************/
#ifndef __TIMER_H__
#define __TIMER_H__

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/

#define TIMER_ARR (10000-1)

/************************ 变量定义 ************************/

/************************ 函数定义 ************************/
void my_timer_init(void);
void my_timer_set_duty(uint8_t duty);
void timer_gpio_init(void);
void timer_config(void);
#endif


/****************************End*****************************/
